GopalSaraf/Practicals/PSDL/include/proc/pic18lf2682.inc
// Register: RXFCON1
#define RXFCON1 RXFCON1
RXFCON1                                  equ 0DD5h
// bitfield definitions
RXFCON1_RXF8EN_POSN                      equ 0000h
RXFCON1_RXF8EN_POSITION                  equ 0000h
RXFCON1_RXF8EN_SIZE                      equ 0001h
RXFCON1_RXF8EN_LENGTH                    equ 0001h
RXFCON1_RXF8EN_MASK                      equ 0001h
RXFCON1_RXF9EN_POSN                      equ 0001h
RXFCON1_RXF9EN_POSITION                  equ 0001h
RXFCON1_RXF9EN_SIZE                      equ 0001h
RXFCON1_RXF9EN_LENGTH                    equ 0001h
RXFCON1_RXF9EN_MASK                      equ 0002h
RXFCON1_RXF10EN_POSN                     equ 0002h
RXFCON1_RXF10EN_POSITION                 equ 0002h
RXFCON1_RXF10EN_SIZE                     equ 0001h
RXFCON1_RXF10EN_LENGTH                   equ 0001h
RXFCON1_RXF10EN_MASK                     equ 0004h
RXFCON1_RXF11EN_POSN                     equ 0003h
RXFCON1_RXF11EN_POSITION                 equ 0003h
RXFCON1_RXF11EN_SIZE                     equ 0001h
RXFCON1_RXF11EN_LENGTH                   equ 0001h
RXFCON1_RXF11EN_MASK                     equ 0008h
RXFCON1_RXF12EN_POSN                     equ 0004h
RXFCON1_RXF12EN_POSITION                 equ 0004h
RXFCON1_RXF12EN_SIZE                     equ 0001h
RXFCON1_RXF12EN_LENGTH                   equ 0001h
RXFCON1_RXF12EN_MASK                     equ 0010h
RXFCON1_RXF13EN_POSN                     equ 0005h
RXFCON1_RXF13EN_POSITION                 equ 0005h
RXFCON1_RXF13EN_SIZE                     equ 0001h
RXFCON1_RXF13EN_LENGTH                   equ 0001h
RXFCON1_RXF13EN_MASK                     equ 0020h
RXFCON1_RXF14EN_POSN                     equ 0006h
RXFCON1_RXF14EN_POSITION                 equ 0006h
RXFCON1_RXF14EN_SIZE                     equ 0001h
RXFCON1_RXF14EN_LENGTH                   equ 0001h
RXFCON1_RXF14EN_MASK                     equ 0040h
RXFCON1_RXF15EN_POSN                     equ 0007h
RXFCON1_RXF15EN_POSITION                 equ 0007h
RXFCON1_RXF15EN_SIZE                     equ 0001h
RXFCON1_RXF15EN_LENGTH                   equ 0001h
RXFCON1_RXF15EN_MASK                     equ 0080h

// Register: SDFLC
#define SDFLC SDFLC
SDFLC                                    equ 0DD8h
// bitfield definitions
SDFLC_FLC0_POSN                          equ 0000h
SDFLC_FLC0_POSITION                      equ 0000h
SDFLC_FLC0_SIZE                          equ 0001h
SDFLC_FLC0_LENGTH                        equ 0001h
SDFLC_FLC0_MASK                          equ 0001h
SDFLC_FLC1_POSN                          equ 0001h
SDFLC_FLC1_POSITION                      equ 0001h
SDFLC_FLC1_SIZE                          equ 0001h
SDFLC_FLC1_LENGTH                        equ 0001h
SDFLC_FLC1_MASK                          equ 0002h
SDFLC_FLC2_POSN                          equ 0002h
SDFLC_FLC2_POSITION                      equ 0002h
SDFLC_FLC2_SIZE                          equ 0001h
SDFLC_FLC2_LENGTH                        equ 0001h
SDFLC_FLC2_MASK                          equ 0004h
SDFLC_FLC3_POSN                          equ 0003h
SDFLC_FLC3_POSITION                      equ 0003h
SDFLC_FLC3_SIZE                          equ 0001h
SDFLC_FLC3_LENGTH                        equ 0001h
SDFLC_FLC3_MASK                          equ 0008h
SDFLC_FLC4_POSN                          equ 0004h
SDFLC_FLC4_POSITION                      equ 0004h
SDFLC_FLC4_SIZE                          equ 0001h
SDFLC_FLC4_LENGTH                        equ 0001h
SDFLC_FLC4_MASK                          equ 0010h
SDFLC_DFLC0_POSN                         equ 0000h
SDFLC_DFLC0_POSITION                     equ 0000h
SDFLC_DFLC0_SIZE                         equ 0001h
SDFLC_DFLC0_LENGTH                       equ 0001h
SDFLC_DFLC0_MASK                         equ 0001h
SDFLC_DFLC1_POSN                         equ 0001h
SDFLC_DFLC1_POSITION                     equ 0001h
SDFLC_DFLC1_SIZE                         equ 0001h
SDFLC_DFLC1_LENGTH                       equ 0001h
SDFLC_DFLC1_MASK                         equ 0002h
SDFLC_DFLC2_POSN                         equ 0002h
SDFLC_DFLC2_POSITION                     equ 0002h
SDFLC_DFLC2_SIZE                         equ 0001h
SDFLC_DFLC2_LENGTH                       equ 0001h
SDFLC_DFLC2_MASK                         equ 0004h
SDFLC_DFLC3_POSN                         equ 0003h
SDFLC_DFLC3_POSITION                     equ 0003h
SDFLC_DFLC3_SIZE                         equ 0001h
SDFLC_DFLC3_LENGTH                       equ 0001h
SDFLC_DFLC3_MASK                         equ 0008h
SDFLC_DFLC4_POSN                         equ 0004h
SDFLC_DFLC4_POSITION                     equ 0004h
SDFLC_DFLC4_SIZE                         equ 0001h
SDFLC_DFLC4_LENGTH                       equ 0001h
SDFLC_DFLC4_MASK                         equ 0010h

// Register: RXFBCON0
#define RXFBCON0 RXFBCON0
RXFBCON0                                 equ 0DE0h
// bitfield definitions
RXFBCON0_F0BP_0_POSN                     equ 0000h
RXFBCON0_F0BP_0_POSITION                 equ 0000h
RXFBCON0_F0BP_0_SIZE                     equ 0001h
RXFBCON0_F0BP_0_LENGTH                   equ 0001h
RXFBCON0_F0BP_0_MASK                     equ 0001h
RXFBCON0_F0BP_1_POSN                     equ 0001h
RXFBCON0_F0BP_1_POSITION                 equ 0001h
RXFBCON0_F0BP_1_SIZE                     equ 0001h
RXFBCON0_F0BP_1_LENGTH                   equ 0001h
RXFBCON0_F0BP_1_MASK                     equ 0002h
RXFBCON0_F0BP_2_POSN                     equ 0002h
RXFBCON0_F0BP_2_POSITION                 equ 0002h
RXFBCON0_F0BP_2_SIZE                     equ 0001h
RXFBCON0_F0BP_2_LENGTH                   equ 0001h
RXFBCON0_F0BP_2_MASK                     equ 0004h
RXFBCON0_F0BP_3_POSN                     equ 0003h
RXFBCON0_F0BP_3_POSITION                 equ 0003h
RXFBCON0_F0BP_3_SIZE                     equ 0001h
RXFBCON0_F0BP_3_LENGTH                   equ 0001h
RXFBCON0_F0BP_3_MASK                     equ 0008h
RXFBCON0_F1BP_0_POSN                     equ 0004h
RXFBCON0_F1BP_0_POSITION                 equ 0004h
RXFBCON0_F1BP_0_SIZE                     equ 0001h
RXFBCON0_F1BP_0_LENGTH                   equ 0001h
RXFBCON0_F1BP_0_MASK                     equ 0010h
RXFBCON0_F1BP_1_POSN                     equ 0005h
RXFBCON0_F1BP_1_POSITION                 equ 0005h
RXFBCON0_F1BP_1_SIZE                     equ 0001h
RXFBCON0_F1BP_1_LENGTH                   equ 0001h
RXFBCON0_F1BP_1_MASK                     equ 0020h
RXFBCON0_F1BP_2_POSN                     equ 0006h
RXFBCON0_F1BP_2_POSITION                 equ 0006h
RXFBCON0_F1BP_2_SIZE                     equ 0001h
RXFBCON0_F1BP_2_LENGTH                   equ 0001h
RXFBCON0_F1BP_2_MASK                     equ 0040h
RXFBCON0_F1BP_3_POSN                     equ 0007h
RXFBCON0_F1BP_3_POSITION                 equ 0007h
RXFBCON0_F1BP_3_SIZE                     equ 0001h
RXFBCON0_F1BP_3_LENGTH                   equ 0001h
RXFBCON0_F1BP_3_MASK                     equ 0080h
RXFBCON0_F0BP_01_POSN                    equ 0000h
RXFBCON0_F0BP_01_POSITION                equ 0000h
RXFBCON0_F0BP_01_SIZE                    equ 0001h
RXFBCON0_F0BP_01_LENGTH                  equ 0001h
RXFBCON0_F0BP_01_MASK                    equ 0001h

