GopalSaraf/Practicals/PSDL/include/proc/pic18lf2682.inc
// Register: MSEL3
#define MSEL3 MSEL3
MSEL3                                    equ 0DF3h
// bitfield definitions
MSEL3_FIL12_0_POSN                       equ 0000h
MSEL3_FIL12_0_POSITION                   equ 0000h
MSEL3_FIL12_0_SIZE                       equ 0001h
MSEL3_FIL12_0_LENGTH                     equ 0001h
MSEL3_FIL12_0_MASK                       equ 0001h
MSEL3_FIL12_1_POSN                       equ 0001h
MSEL3_FIL12_1_POSITION                   equ 0001h
MSEL3_FIL12_1_SIZE                       equ 0001h
MSEL3_FIL12_1_LENGTH                     equ 0001h
MSEL3_FIL12_1_MASK                       equ 0002h
MSEL3_FIL13_0_POSN                       equ 0002h
MSEL3_FIL13_0_POSITION                   equ 0002h
MSEL3_FIL13_0_SIZE                       equ 0001h
MSEL3_FIL13_0_LENGTH                     equ 0001h
MSEL3_FIL13_0_MASK                       equ 0004h
MSEL3_FIL13_1_POSN                       equ 0003h
MSEL3_FIL13_1_POSITION                   equ 0003h
MSEL3_FIL13_1_SIZE                       equ 0001h
MSEL3_FIL13_1_LENGTH                     equ 0001h
MSEL3_FIL13_1_MASK                       equ 0008h
MSEL3_FIL14_0_POSN                       equ 0004h
MSEL3_FIL14_0_POSITION                   equ 0004h
MSEL3_FIL14_0_SIZE                       equ 0001h
MSEL3_FIL14_0_LENGTH                     equ 0001h
MSEL3_FIL14_0_MASK                       equ 0010h
MSEL3_FIL14_1_POSN                       equ 0005h
MSEL3_FIL14_1_POSITION                   equ 0005h
MSEL3_FIL14_1_SIZE                       equ 0001h
MSEL3_FIL14_1_LENGTH                     equ 0001h
MSEL3_FIL14_1_MASK                       equ 0020h
MSEL3_FIL15_0_POSN                       equ 0006h
MSEL3_FIL15_0_POSITION                   equ 0006h
MSEL3_FIL15_0_SIZE                       equ 0001h
MSEL3_FIL15_0_LENGTH                     equ 0001h
MSEL3_FIL15_0_MASK                       equ 0040h
MSEL3_FIL15_1_POSN                       equ 0007h
MSEL3_FIL15_1_POSITION                   equ 0007h
MSEL3_FIL15_1_SIZE                       equ 0001h
MSEL3_FIL15_1_LENGTH                     equ 0001h
MSEL3_FIL15_1_MASK                       equ 0080h

// Register: BSEL0
#define BSEL0 BSEL0
BSEL0                                    equ 0DF8h
// bitfield definitions
BSEL0_B0TXEN_POSN                        equ 0002h
BSEL0_B0TXEN_POSITION                    equ 0002h
BSEL0_B0TXEN_SIZE                        equ 0001h
BSEL0_B0TXEN_LENGTH                      equ 0001h
BSEL0_B0TXEN_MASK                        equ 0004h
BSEL0_B1TXEN_POSN                        equ 0003h
BSEL0_B1TXEN_POSITION                    equ 0003h
BSEL0_B1TXEN_SIZE                        equ 0001h
BSEL0_B1TXEN_LENGTH                      equ 0001h
BSEL0_B1TXEN_MASK                        equ 0008h
BSEL0_B2TXEN_POSN                        equ 0004h
BSEL0_B2TXEN_POSITION                    equ 0004h
BSEL0_B2TXEN_SIZE                        equ 0001h
BSEL0_B2TXEN_LENGTH                      equ 0001h
BSEL0_B2TXEN_MASK                        equ 0010h
BSEL0_B3TXEN_POSN                        equ 0005h
BSEL0_B3TXEN_POSITION                    equ 0005h
BSEL0_B3TXEN_SIZE                        equ 0001h
BSEL0_B3TXEN_LENGTH                      equ 0001h
BSEL0_B3TXEN_MASK                        equ 0020h
BSEL0_B4TXEN_POSN                        equ 0006h
BSEL0_B4TXEN_POSITION                    equ 0006h
BSEL0_B4TXEN_SIZE                        equ 0001h
BSEL0_B4TXEN_LENGTH                      equ 0001h
BSEL0_B4TXEN_MASK                        equ 0040h
BSEL0_B5TXEN_POSN                        equ 0007h
BSEL0_B5TXEN_POSITION                    equ 0007h
BSEL0_B5TXEN_SIZE                        equ 0001h
BSEL0_B5TXEN_LENGTH                      equ 0001h
BSEL0_B5TXEN_MASK                        equ 0080h

// Register: BIE0
#define BIE0 BIE0
BIE0                                     equ 0DFAh
// bitfield definitions
BIE0_RXB0IE_POSN                         equ 0000h
BIE0_RXB0IE_POSITION                     equ 0000h
BIE0_RXB0IE_SIZE                         equ 0001h
BIE0_RXB0IE_LENGTH                       equ 0001h
BIE0_RXB0IE_MASK                         equ 0001h
BIE0_RXB1IE_POSN                         equ 0001h
BIE0_RXB1IE_POSITION                     equ 0001h
BIE0_RXB1IE_SIZE                         equ 0001h
BIE0_RXB1IE_LENGTH                       equ 0001h
BIE0_RXB1IE_MASK                         equ 0002h
BIE0_B0IE_POSN                           equ 0002h
BIE0_B0IE_POSITION                       equ 0002h
BIE0_B0IE_SIZE                           equ 0001h
BIE0_B0IE_LENGTH                         equ 0001h
BIE0_B0IE_MASK                           equ 0004h
BIE0_B1IE_POSN                           equ 0003h
BIE0_B1IE_POSITION                       equ 0003h
BIE0_B1IE_SIZE                           equ 0001h
BIE0_B1IE_LENGTH                         equ 0001h
BIE0_B1IE_MASK                           equ 0008h
BIE0_B2IE_POSN                           equ 0004h
BIE0_B2IE_POSITION                       equ 0004h
BIE0_B2IE_SIZE                           equ 0001h
BIE0_B2IE_LENGTH                         equ 0001h
BIE0_B2IE_MASK                           equ 0010h
BIE0_B3IE_POSN                           equ 0005h
BIE0_B3IE_POSITION                       equ 0005h
BIE0_B3IE_SIZE                           equ 0001h
BIE0_B3IE_LENGTH                         equ 0001h
BIE0_B3IE_MASK                           equ 0020h
BIE0_B4IE_POSN                           equ 0006h
BIE0_B4IE_POSITION                       equ 0006h
BIE0_B4IE_SIZE                           equ 0001h
BIE0_B4IE_LENGTH                         equ 0001h
BIE0_B4IE_MASK                           equ 0040h
BIE0_B5IE_POSN                           equ 0007h
BIE0_B5IE_POSITION                       equ 0007h
BIE0_B5IE_SIZE                           equ 0001h
BIE0_B5IE_LENGTH                         equ 0001h
BIE0_B5IE_MASK                           equ 0080h
BIE0_DRXB0IE_POSN                        equ 0000h
BIE0_DRXB0IE_POSITION                    equ 0000h
BIE0_DRXB0IE_SIZE                        equ 0001h
BIE0_DRXB0IE_LENGTH                      equ 0001h
BIE0_DRXB0IE_MASK                        equ 0001h
BIE0_DRXB1IE_POSN                        equ 0001h
BIE0_DRXB1IE_POSITION                    equ 0001h
BIE0_DRXB1IE_SIZE                        equ 0001h
BIE0_DRXB1IE_LENGTH                      equ 0001h
BIE0_DRXB1IE_MASK                        equ 0002h

