GopalSaraf/Practicals/PSDL/include/proc/pic18lf2682.inc
// Register: B2D3
#define B2D3 B2D3
B2D3                                     equ 0E49h
// bitfield definitions
B2D3_B2D30_POSN                          equ 0000h
B2D3_B2D30_POSITION                      equ 0000h
B2D3_B2D30_SIZE                          equ 0001h
B2D3_B2D30_LENGTH                        equ 0001h
B2D3_B2D30_MASK                          equ 0001h
B2D3_B2D31_POSN                          equ 0001h
B2D3_B2D31_POSITION                      equ 0001h
B2D3_B2D31_SIZE                          equ 0001h
B2D3_B2D31_LENGTH                        equ 0001h
B2D3_B2D31_MASK                          equ 0002h
B2D3_B2D32_POSN                          equ 0002h
B2D3_B2D32_POSITION                      equ 0002h
B2D3_B2D32_SIZE                          equ 0001h
B2D3_B2D32_LENGTH                        equ 0001h
B2D3_B2D32_MASK                          equ 0004h
B2D3_B2D33_POSN                          equ 0003h
B2D3_B2D33_POSITION                      equ 0003h
B2D3_B2D33_SIZE                          equ 0001h
B2D3_B2D33_LENGTH                        equ 0001h
B2D3_B2D33_MASK                          equ 0008h
B2D3_B2D34_POSN                          equ 0004h
B2D3_B2D34_POSITION                      equ 0004h
B2D3_B2D34_SIZE                          equ 0001h
B2D3_B2D34_LENGTH                        equ 0001h
B2D3_B2D34_MASK                          equ 0010h
B2D3_B2D35_POSN                          equ 0005h
B2D3_B2D35_POSITION                      equ 0005h
B2D3_B2D35_SIZE                          equ 0001h
B2D3_B2D35_LENGTH                        equ 0001h
B2D3_B2D35_MASK                          equ 0020h
B2D3_B2D36_POSN                          equ 0006h
B2D3_B2D36_POSITION                      equ 0006h
B2D3_B2D36_SIZE                          equ 0001h
B2D3_B2D36_LENGTH                        equ 0001h
B2D3_B2D36_MASK                          equ 0040h
B2D3_B2D37_POSN                          equ 0007h
B2D3_B2D37_POSITION                      equ 0007h
B2D3_B2D37_SIZE                          equ 0001h
B2D3_B2D37_LENGTH                        equ 0001h
B2D3_B2D37_MASK                          equ 0080h

// Register: B2D4
#define B2D4 B2D4
B2D4                                     equ 0E4Ah
// bitfield definitions
B2D4_B2D40_POSN                          equ 0000h
B2D4_B2D40_POSITION                      equ 0000h
B2D4_B2D40_SIZE                          equ 0001h
B2D4_B2D40_LENGTH                        equ 0001h
B2D4_B2D40_MASK                          equ 0001h
B2D4_B2D41_POSN                          equ 0001h
B2D4_B2D41_POSITION                      equ 0001h
B2D4_B2D41_SIZE                          equ 0001h
B2D4_B2D41_LENGTH                        equ 0001h
B2D4_B2D41_MASK                          equ 0002h
B2D4_B2D42_POSN                          equ 0002h
B2D4_B2D42_POSITION                      equ 0002h
B2D4_B2D42_SIZE                          equ 0001h
B2D4_B2D42_LENGTH                        equ 0001h
B2D4_B2D42_MASK                          equ 0004h
B2D4_B2D43_POSN                          equ 0003h
B2D4_B2D43_POSITION                      equ 0003h
B2D4_B2D43_SIZE                          equ 0001h
B2D4_B2D43_LENGTH                        equ 0001h
B2D4_B2D43_MASK                          equ 0008h
B2D4_B2D44_POSN                          equ 0004h
B2D4_B2D44_POSITION                      equ 0004h
B2D4_B2D44_SIZE                          equ 0001h
B2D4_B2D44_LENGTH                        equ 0001h
B2D4_B2D44_MASK                          equ 0010h
B2D4_B2D45_POSN                          equ 0005h
B2D4_B2D45_POSITION                      equ 0005h
B2D4_B2D45_SIZE                          equ 0001h
B2D4_B2D45_LENGTH                        equ 0001h
B2D4_B2D45_MASK                          equ 0020h
B2D4_B2D46_POSN                          equ 0006h
B2D4_B2D46_POSITION                      equ 0006h
B2D4_B2D46_SIZE                          equ 0001h
B2D4_B2D46_LENGTH                        equ 0001h
B2D4_B2D46_MASK                          equ 0040h
B2D4_B2D47_POSN                          equ 0007h
B2D4_B2D47_POSITION                      equ 0007h
B2D4_B2D47_SIZE                          equ 0001h
B2D4_B2D47_LENGTH                        equ 0001h
B2D4_B2D47_MASK                          equ 0080h

// Register: B2D5
#define B2D5 B2D5
B2D5                                     equ 0E4Bh
// bitfield definitions
B2D5_B2D50_POSN                          equ 0000h
B2D5_B2D50_POSITION                      equ 0000h
B2D5_B2D50_SIZE                          equ 0001h
B2D5_B2D50_LENGTH                        equ 0001h
B2D5_B2D50_MASK                          equ 0001h
B2D5_B2D51_POSN                          equ 0001h
B2D5_B2D51_POSITION                      equ 0001h
B2D5_B2D51_SIZE                          equ 0001h
B2D5_B2D51_LENGTH                        equ 0001h
B2D5_B2D51_MASK                          equ 0002h
B2D5_B2D52_POSN                          equ 0002h
B2D5_B2D52_POSITION                      equ 0002h
B2D5_B2D52_SIZE                          equ 0001h
B2D5_B2D52_LENGTH                        equ 0001h
B2D5_B2D52_MASK                          equ 0004h
B2D5_B2D53_POSN                          equ 0003h
B2D5_B2D53_POSITION                      equ 0003h
B2D5_B2D53_SIZE                          equ 0001h
B2D5_B2D53_LENGTH                        equ 0001h
B2D5_B2D53_MASK                          equ 0008h
B2D5_B2D54_POSN                          equ 0004h
B2D5_B2D54_POSITION                      equ 0004h
B2D5_B2D54_SIZE                          equ 0001h
B2D5_B2D54_LENGTH                        equ 0001h
B2D5_B2D54_MASK                          equ 0010h
B2D5_B2D55_POSN                          equ 0005h
B2D5_B2D55_POSITION                      equ 0005h
B2D5_B2D55_SIZE                          equ 0001h
B2D5_B2D55_LENGTH                        equ 0001h
B2D5_B2D55_MASK                          equ 0020h
B2D5_B2D56_POSN                          equ 0006h
B2D5_B2D56_POSITION                      equ 0006h
B2D5_B2D56_SIZE                          equ 0001h
B2D5_B2D56_LENGTH                        equ 0001h
B2D5_B2D56_MASK                          equ 0040h
B2D5_B2D57_POSN                          equ 0007h
B2D5_B2D57_POSITION                      equ 0007h
B2D5_B2D57_SIZE                          equ 0001h
B2D5_B2D57_LENGTH                        equ 0001h
B2D5_B2D57_MASK                          equ 0080h

