GopalSaraf/Practicals/PSDL/include/proc/pic18lf2682.inc
// Register: RXM1EIDH
#define RXM1EIDH RXM1EIDH
RXM1EIDH                                 equ 0F1Eh
// bitfield definitions
RXM1EIDH_EID8_POSN                       equ 0000h
RXM1EIDH_EID8_POSITION                   equ 0000h
RXM1EIDH_EID8_SIZE                       equ 0001h
RXM1EIDH_EID8_LENGTH                     equ 0001h
RXM1EIDH_EID8_MASK                       equ 0001h
RXM1EIDH_EID9_POSN                       equ 0001h
RXM1EIDH_EID9_POSITION                   equ 0001h
RXM1EIDH_EID9_SIZE                       equ 0001h
RXM1EIDH_EID9_LENGTH                     equ 0001h
RXM1EIDH_EID9_MASK                       equ 0002h
RXM1EIDH_EID10_POSN                      equ 0002h
RXM1EIDH_EID10_POSITION                  equ 0002h
RXM1EIDH_EID10_SIZE                      equ 0001h
RXM1EIDH_EID10_LENGTH                    equ 0001h
RXM1EIDH_EID10_MASK                      equ 0004h
RXM1EIDH_EID11_POSN                      equ 0003h
RXM1EIDH_EID11_POSITION                  equ 0003h
RXM1EIDH_EID11_SIZE                      equ 0001h
RXM1EIDH_EID11_LENGTH                    equ 0001h
RXM1EIDH_EID11_MASK                      equ 0008h
RXM1EIDH_EID12_POSN                      equ 0004h
RXM1EIDH_EID12_POSITION                  equ 0004h
RXM1EIDH_EID12_SIZE                      equ 0001h
RXM1EIDH_EID12_LENGTH                    equ 0001h
RXM1EIDH_EID12_MASK                      equ 0010h
RXM1EIDH_EID13_POSN                      equ 0005h
RXM1EIDH_EID13_POSITION                  equ 0005h
RXM1EIDH_EID13_SIZE                      equ 0001h
RXM1EIDH_EID13_LENGTH                    equ 0001h
RXM1EIDH_EID13_MASK                      equ 0020h
RXM1EIDH_EID14_POSN                      equ 0006h
RXM1EIDH_EID14_POSITION                  equ 0006h
RXM1EIDH_EID14_SIZE                      equ 0001h
RXM1EIDH_EID14_LENGTH                    equ 0001h
RXM1EIDH_EID14_MASK                      equ 0040h
RXM1EIDH_EID15_POSN                      equ 0007h
RXM1EIDH_EID15_POSITION                  equ 0007h
RXM1EIDH_EID15_SIZE                      equ 0001h
RXM1EIDH_EID15_LENGTH                    equ 0001h
RXM1EIDH_EID15_MASK                      equ 0080h
RXM1EIDH_RXM1EID8_POSN                   equ 0000h
RXM1EIDH_RXM1EID8_POSITION               equ 0000h
RXM1EIDH_RXM1EID8_SIZE                   equ 0001h
RXM1EIDH_RXM1EID8_LENGTH                 equ 0001h
RXM1EIDH_RXM1EID8_MASK                   equ 0001h
RXM1EIDH_RXM1EID9_POSN                   equ 0001h
RXM1EIDH_RXM1EID9_POSITION               equ 0001h
RXM1EIDH_RXM1EID9_SIZE                   equ 0001h
RXM1EIDH_RXM1EID9_LENGTH                 equ 0001h
RXM1EIDH_RXM1EID9_MASK                   equ 0002h
RXM1EIDH_RXM1EID10_POSN                  equ 0002h
RXM1EIDH_RXM1EID10_POSITION              equ 0002h
RXM1EIDH_RXM1EID10_SIZE                  equ 0001h
RXM1EIDH_RXM1EID10_LENGTH                equ 0001h
RXM1EIDH_RXM1EID10_MASK                  equ 0004h
RXM1EIDH_RXM1EID11_POSN                  equ 0003h
RXM1EIDH_RXM1EID11_POSITION              equ 0003h
RXM1EIDH_RXM1EID11_SIZE                  equ 0001h
RXM1EIDH_RXM1EID11_LENGTH                equ 0001h
RXM1EIDH_RXM1EID11_MASK                  equ 0008h
RXM1EIDH_RXM1EID12_POSN                  equ 0004h
RXM1EIDH_RXM1EID12_POSITION              equ 0004h
RXM1EIDH_RXM1EID12_SIZE                  equ 0001h
RXM1EIDH_RXM1EID12_LENGTH                equ 0001h
RXM1EIDH_RXM1EID12_MASK                  equ 0010h
RXM1EIDH_RXM1EID13_POSN                  equ 0005h
RXM1EIDH_RXM1EID13_POSITION              equ 0005h
RXM1EIDH_RXM1EID13_SIZE                  equ 0001h
RXM1EIDH_RXM1EID13_LENGTH                equ 0001h
RXM1EIDH_RXM1EID13_MASK                  equ 0020h
RXM1EIDH_RXM1EID14_POSN                  equ 0006h
RXM1EIDH_RXM1EID14_POSITION              equ 0006h
RXM1EIDH_RXM1EID14_SIZE                  equ 0001h
RXM1EIDH_RXM1EID14_LENGTH                equ 0001h
RXM1EIDH_RXM1EID14_MASK                  equ 0040h
RXM1EIDH_RXM1EID15_POSN                  equ 0007h
RXM1EIDH_RXM1EID15_POSITION              equ 0007h
RXM1EIDH_RXM1EID15_SIZE                  equ 0001h
RXM1EIDH_RXM1EID15_LENGTH                equ 0001h
RXM1EIDH_RXM1EID15_MASK                  equ 0080h

// Register: RXM1EIDL
#define RXM1EIDL RXM1EIDL
RXM1EIDL                                 equ 0F1Fh
// bitfield definitions
RXM1EIDL_EID0_POSN                       equ 0000h
RXM1EIDL_EID0_POSITION                   equ 0000h
RXM1EIDL_EID0_SIZE                       equ 0001h
RXM1EIDL_EID0_LENGTH                     equ 0001h
RXM1EIDL_EID0_MASK                       equ 0001h
RXM1EIDL_EID1_POSN                       equ 0001h
RXM1EIDL_EID1_POSITION                   equ 0001h
RXM1EIDL_EID1_SIZE                       equ 0001h
RXM1EIDL_EID1_LENGTH                     equ 0001h
RXM1EIDL_EID1_MASK                       equ 0002h
RXM1EIDL_EID2_POSN                       equ 0002h
RXM1EIDL_EID2_POSITION                   equ 0002h
RXM1EIDL_EID2_SIZE                       equ 0001h
RXM1EIDL_EID2_LENGTH                     equ 0001h
RXM1EIDL_EID2_MASK                       equ 0004h
RXM1EIDL_EID3_POSN                       equ 0003h
RXM1EIDL_EID3_POSITION                   equ 0003h
RXM1EIDL_EID3_SIZE                       equ 0001h
RXM1EIDL_EID3_LENGTH                     equ 0001h
RXM1EIDL_EID3_MASK                       equ 0008h
RXM1EIDL_EID4_POSN                       equ 0004h
RXM1EIDL_EID4_POSITION                   equ 0004h
RXM1EIDL_EID4_SIZE                       equ 0001h
RXM1EIDL_EID4_LENGTH                     equ 0001h
RXM1EIDL_EID4_MASK                       equ 0010h
RXM1EIDL_EID5_POSN                       equ 0005h
RXM1EIDL_EID5_POSITION                   equ 0005h
RXM1EIDL_EID5_SIZE                       equ 0001h
RXM1EIDL_EID5_LENGTH                     equ 0001h
RXM1EIDL_EID5_MASK                       equ 0020h
RXM1EIDL_EID6_POSN                       equ 0006h
RXM1EIDL_EID6_POSITION                   equ 0006h
RXM1EIDL_EID6_SIZE                       equ 0001h
RXM1EIDL_EID6_LENGTH                     equ 0001h
RXM1EIDL_EID6_MASK                       equ 0040h
RXM1EIDL_EID7_POSN                       equ 0007h
RXM1EIDL_EID7_POSITION                   equ 0007h
RXM1EIDL_EID7_SIZE                       equ 0001h
RXM1EIDL_EID7_LENGTH                     equ 0001h
RXM1EIDL_EID7_MASK                       equ 0080h
RXM1EIDL_RXM1EID0_POSN                   equ 0000h
RXM1EIDL_RXM1EID0_POSITION               equ 0000h
RXM1EIDL_RXM1EID0_SIZE                   equ 0001h
RXM1EIDL_RXM1EID0_LENGTH                 equ 0001h
RXM1EIDL_RXM1EID0_MASK                   equ 0001h
RXM1EIDL_RXM1EID1_POSN                   equ 0001h
RXM1EIDL_RXM1EID1_POSITION               equ 0001h
RXM1EIDL_RXM1EID1_SIZE                   equ 0001h
RXM1EIDL_RXM1EID1_LENGTH                 equ 0001h
RXM1EIDL_RXM1EID1_MASK                   equ 0002h
RXM1EIDL_RXM1EID2_POSN                   equ 0002h
RXM1EIDL_RXM1EID2_POSITION               equ 0002h
RXM1EIDL_RXM1EID2_SIZE                   equ 0001h
RXM1EIDL_RXM1EID2_LENGTH                 equ 0001h
RXM1EIDL_RXM1EID2_MASK                   equ 0004h
RXM1EIDL_RXM1EID3_POSN                   equ 0003h
RXM1EIDL_RXM1EID3_POSITION               equ 0003h
RXM1EIDL_RXM1EID3_SIZE                   equ 0001h
RXM1EIDL_RXM1EID3_LENGTH                 equ 0001h
RXM1EIDL_RXM1EID3_MASK                   equ 0008h
RXM1EIDL_RXM1EID4_POSN                   equ 0004h
RXM1EIDL_RXM1EID4_POSITION               equ 0004h
RXM1EIDL_RXM1EID4_SIZE                   equ 0001h
RXM1EIDL_RXM1EID4_LENGTH                 equ 0001h
RXM1EIDL_RXM1EID4_MASK                   equ 0010h
RXM1EIDL_RXM1EID5_POSN                   equ 0005h
RXM1EIDL_RXM1EID5_POSITION               equ 0005h
RXM1EIDL_RXM1EID5_SIZE                   equ 0001h
RXM1EIDL_RXM1EID5_LENGTH                 equ 0001h
RXM1EIDL_RXM1EID5_MASK                   equ 0020h
RXM1EIDL_RXM1EID6_POSN                   equ 0006h
RXM1EIDL_RXM1EID6_POSITION               equ 0006h
RXM1EIDL_RXM1EID6_SIZE                   equ 0001h
RXM1EIDL_RXM1EID6_LENGTH                 equ 0001h
RXM1EIDL_RXM1EID6_MASK                   equ 0040h
RXM1EIDL_RXM1EID7_POSN                   equ 0007h
RXM1EIDL_RXM1EID7_POSITION               equ 0007h
RXM1EIDL_RXM1EID7_SIZE                   equ 0001h
RXM1EIDL_RXM1EID7_LENGTH                 equ 0001h
RXM1EIDL_RXM1EID7_MASK                   equ 0080h

// Register: TXB2CON
#define TXB2CON TXB2CON
TXB2CON                                  equ 0F20h
// bitfield definitions
TXB2CON_TXPRI0_POSN                      equ 0000h
TXB2CON_TXPRI0_POSITION                  equ 0000h
TXB2CON_TXPRI0_SIZE                      equ 0001h
TXB2CON_TXPRI0_LENGTH                    equ 0001h
TXB2CON_TXPRI0_MASK                      equ 0001h
TXB2CON_TXPRI1_POSN                      equ 0001h
TXB2CON_TXPRI1_POSITION                  equ 0001h
TXB2CON_TXPRI1_SIZE                      equ 0001h
TXB2CON_TXPRI1_LENGTH                    equ 0001h
TXB2CON_TXPRI1_MASK                      equ 0002h
TXB2CON_TXREQ_POSN                       equ 0003h
TXB2CON_TXREQ_POSITION                   equ 0003h
TXB2CON_TXREQ_SIZE                       equ 0001h
TXB2CON_TXREQ_LENGTH                     equ 0001h
TXB2CON_TXREQ_MASK                       equ 0008h
TXB2CON_TXERR_POSN                       equ 0004h
TXB2CON_TXERR_POSITION                   equ 0004h
TXB2CON_TXERR_SIZE                       equ 0001h
TXB2CON_TXERR_LENGTH                     equ 0001h
TXB2CON_TXERR_MASK                       equ 0010h
TXB2CON_TXLARB_POSN                      equ 0005h
TXB2CON_TXLARB_POSITION                  equ 0005h
TXB2CON_TXLARB_SIZE                      equ 0001h
TXB2CON_TXLARB_LENGTH                    equ 0001h
TXB2CON_TXLARB_MASK                      equ 0020h
TXB2CON_TXABT_POSN                       equ 0006h
TXB2CON_TXABT_POSITION                   equ 0006h
TXB2CON_TXABT_SIZE                       equ 0001h
TXB2CON_TXABT_LENGTH                     equ 0001h
TXB2CON_TXABT_MASK                       equ 0040h
TXB2CON_TXBIF_POSN                       equ 0007h
TXB2CON_TXBIF_POSITION                   equ 0007h
TXB2CON_TXBIF_SIZE                       equ 0001h
TXB2CON_TXBIF_LENGTH                     equ 0001h
TXB2CON_TXBIF_MASK                       equ 0080h
TXB2CON_TXBIFBXB2CON_POSN                equ 0007h
TXB2CON_TXBIFBXB2CON_POSITION            equ 0007h
TXB2CON_TXBIFBXB2CON_SIZE                equ 0001h
TXB2CON_TXBIFBXB2CON_LENGTH              equ 0001h
TXB2CON_TXBIFBXB2CON_MASK                equ 0080h
TXB2CON_TXB2PRI0_POSN                    equ 0000h
TXB2CON_TXB2PRI0_POSITION                equ 0000h
TXB2CON_TXB2PRI0_SIZE                    equ 0001h
TXB2CON_TXB2PRI0_LENGTH                  equ 0001h
TXB2CON_TXB2PRI0_MASK                    equ 0001h
TXB2CON_TXB2PRI1_POSN                    equ 0001h
TXB2CON_TXB2PRI1_POSITION                equ 0001h
TXB2CON_TXB2PRI1_SIZE                    equ 0001h
TXB2CON_TXB2PRI1_LENGTH                  equ 0001h
TXB2CON_TXB2PRI1_MASK                    equ 0002h
TXB2CON_TXB2REQ_POSN                     equ 0003h
TXB2CON_TXB2REQ_POSITION                 equ 0003h
TXB2CON_TXB2REQ_SIZE                     equ 0001h
TXB2CON_TXB2REQ_LENGTH                   equ 0001h
TXB2CON_TXB2REQ_MASK                     equ 0008h
TXB2CON_TXB2ERR_POSN                     equ 0004h
TXB2CON_TXB2ERR_POSITION                 equ 0004h
TXB2CON_TXB2ERR_SIZE                     equ 0001h
TXB2CON_TXB2ERR_LENGTH                   equ 0001h
TXB2CON_TXB2ERR_MASK                     equ 0010h
TXB2CON_TXB2LARB_POSN                    equ 0005h
TXB2CON_TXB2LARB_POSITION                equ 0005h
TXB2CON_TXB2LARB_SIZE                    equ 0001h
TXB2CON_TXB2LARB_LENGTH                  equ 0001h
TXB2CON_TXB2LARB_MASK                    equ 0020h
TXB2CON_TXB2ABT_POSN                     equ 0006h
TXB2CON_TXB2ABT_POSITION                 equ 0006h
TXB2CON_TXB2ABT_SIZE                     equ 0001h
TXB2CON_TXB2ABT_LENGTH                   equ 0001h
TXB2CON_TXB2ABT_MASK                     equ 0040h
TXB2CON_TX2IF_POSN                       equ 0007h
TXB2CON_TX2IF_POSITION                   equ 0007h
TXB2CON_TX2IF_SIZE                       equ 0001h
TXB2CON_TX2IF_LENGTH                     equ 0001h
TXB2CON_TX2IF_MASK                       equ 0080h

// Register: TXB2SIDH
#define TXB2SIDH TXB2SIDH
TXB2SIDH                                 equ 0F21h
// bitfield definitions
TXB2SIDH_SID3_POSN                       equ 0000h
TXB2SIDH_SID3_POSITION                   equ 0000h
TXB2SIDH_SID3_SIZE                       equ 0001h
TXB2SIDH_SID3_LENGTH                     equ 0001h
TXB2SIDH_SID3_MASK                       equ 0001h
TXB2SIDH_SID4_POSN                       equ 0001h
TXB2SIDH_SID4_POSITION                   equ 0001h
TXB2SIDH_SID4_SIZE                       equ 0001h
TXB2SIDH_SID4_LENGTH                     equ 0001h
TXB2SIDH_SID4_MASK                       equ 0002h
TXB2SIDH_SID5_POSN                       equ 0002h
TXB2SIDH_SID5_POSITION                   equ 0002h
TXB2SIDH_SID5_SIZE                       equ 0001h
TXB2SIDH_SID5_LENGTH                     equ 0001h
TXB2SIDH_SID5_MASK                       equ 0004h
TXB2SIDH_SID6_POSN                       equ 0003h
TXB2SIDH_SID6_POSITION                   equ 0003h
TXB2SIDH_SID6_SIZE                       equ 0001h
TXB2SIDH_SID6_LENGTH                     equ 0001h
TXB2SIDH_SID6_MASK                       equ 0008h
TXB2SIDH_SID7_POSN                       equ 0004h
TXB2SIDH_SID7_POSITION                   equ 0004h
TXB2SIDH_SID7_SIZE                       equ 0001h
TXB2SIDH_SID7_LENGTH                     equ 0001h
TXB2SIDH_SID7_MASK                       equ 0010h
TXB2SIDH_SID8_POSN                       equ 0005h
TXB2SIDH_SID8_POSITION                   equ 0005h
TXB2SIDH_SID8_SIZE                       equ 0001h
TXB2SIDH_SID8_LENGTH                     equ 0001h
TXB2SIDH_SID8_MASK                       equ 0020h
TXB2SIDH_SID9_POSN                       equ 0006h
TXB2SIDH_SID9_POSITION                   equ 0006h
TXB2SIDH_SID9_SIZE                       equ 0001h
TXB2SIDH_SID9_LENGTH                     equ 0001h
TXB2SIDH_SID9_MASK                       equ 0040h
TXB2SIDH_SID10_POSN                      equ 0007h
TXB2SIDH_SID10_POSITION                  equ 0007h
TXB2SIDH_SID10_SIZE                      equ 0001h
TXB2SIDH_SID10_LENGTH                    equ 0001h
TXB2SIDH_SID10_MASK                      equ 0080h
TXB2SIDH_TXB2SID3_POSN                   equ 0000h
TXB2SIDH_TXB2SID3_POSITION               equ 0000h
TXB2SIDH_TXB2SID3_SIZE                   equ 0001h
TXB2SIDH_TXB2SID3_LENGTH                 equ 0001h
TXB2SIDH_TXB2SID3_MASK                   equ 0001h
TXB2SIDH_TXB2SID4_POSN                   equ 0001h
TXB2SIDH_TXB2SID4_POSITION               equ 0001h
TXB2SIDH_TXB2SID4_SIZE                   equ 0001h
TXB2SIDH_TXB2SID4_LENGTH                 equ 0001h
TXB2SIDH_TXB2SID4_MASK                   equ 0002h
TXB2SIDH_TXB2SID5_POSN                   equ 0002h
TXB2SIDH_TXB2SID5_POSITION               equ 0002h
TXB2SIDH_TXB2SID5_SIZE                   equ 0001h
TXB2SIDH_TXB2SID5_LENGTH                 equ 0001h
TXB2SIDH_TXB2SID5_MASK                   equ 0004h
TXB2SIDH_TXB2SID6_POSN                   equ 0003h
TXB2SIDH_TXB2SID6_POSITION               equ 0003h
TXB2SIDH_TXB2SID6_SIZE                   equ 0001h
TXB2SIDH_TXB2SID6_LENGTH                 equ 0001h
TXB2SIDH_TXB2SID6_MASK                   equ 0008h
TXB2SIDH_TXB2SID7_POSN                   equ 0004h
TXB2SIDH_TXB2SID7_POSITION               equ 0004h
TXB2SIDH_TXB2SID7_SIZE                   equ 0001h
TXB2SIDH_TXB2SID7_LENGTH                 equ 0001h
TXB2SIDH_TXB2SID7_MASK                   equ 0010h
TXB2SIDH_TXB2SID8_POSN                   equ 0005h
TXB2SIDH_TXB2SID8_POSITION               equ 0005h
TXB2SIDH_TXB2SID8_SIZE                   equ 0001h
TXB2SIDH_TXB2SID8_LENGTH                 equ 0001h
TXB2SIDH_TXB2SID8_MASK                   equ 0020h
TXB2SIDH_TXB2SID9_POSN                   equ 0006h
TXB2SIDH_TXB2SID9_POSITION               equ 0006h
TXB2SIDH_TXB2SID9_SIZE                   equ 0001h
TXB2SIDH_TXB2SID9_LENGTH                 equ 0001h
TXB2SIDH_TXB2SID9_MASK                   equ 0040h
TXB2SIDH_TXB2SID10_POSN                  equ 0007h
TXB2SIDH_TXB2SID10_POSITION              equ 0007h
TXB2SIDH_TXB2SID10_SIZE                  equ 0001h
TXB2SIDH_TXB2SID10_LENGTH                equ 0001h
TXB2SIDH_TXB2SID10_MASK                  equ 0080h

