GopalSaraf/Practicals/PSDL/include/proc/pic18lf2682.inc
// Register: RXB0CON
#define RXB0CON RXB0CON
RXB0CON                                  equ 0F60h
// bitfield definitions
RXB0CON_FILHIT0_POSN                     equ 0000h
RXB0CON_FILHIT0_POSITION                 equ 0000h
RXB0CON_FILHIT0_SIZE                     equ 0001h
RXB0CON_FILHIT0_LENGTH                   equ 0001h
RXB0CON_FILHIT0_MASK                     equ 0001h
RXB0CON_JTOFF_FILHIT1_POSN               equ 0001h
RXB0CON_JTOFF_FILHIT1_POSITION           equ 0001h
RXB0CON_JTOFF_FILHIT1_SIZE               equ 0001h
RXB0CON_JTOFF_FILHIT1_LENGTH             equ 0001h
RXB0CON_JTOFF_FILHIT1_MASK               equ 0002h
RXB0CON_RXB0DBEN_FILHIT2_POSN            equ 0002h
RXB0CON_RXB0DBEN_FILHIT2_POSITION        equ 0002h
RXB0CON_RXB0DBEN_FILHIT2_SIZE            equ 0001h
RXB0CON_RXB0DBEN_FILHIT2_LENGTH          equ 0001h
RXB0CON_RXB0DBEN_FILHIT2_MASK            equ 0004h
RXB0CON_RXRTRRO_FILHIT3_POSN             equ 0003h
RXB0CON_RXRTRRO_FILHIT3_POSITION         equ 0003h
RXB0CON_RXRTRRO_FILHIT3_SIZE             equ 0001h
RXB0CON_RXRTRRO_FILHIT3_LENGTH           equ 0001h
RXB0CON_RXRTRRO_FILHIT3_MASK             equ 0008h
RXB0CON_FILHIT4_POSN                     equ 0004h
RXB0CON_FILHIT4_POSITION                 equ 0004h
RXB0CON_FILHIT4_SIZE                     equ 0001h
RXB0CON_FILHIT4_LENGTH                   equ 0001h
RXB0CON_FILHIT4_MASK                     equ 0010h
RXB0CON_RXM0_RTRRO_POSN                  equ 0005h
RXB0CON_RXM0_RTRRO_POSITION              equ 0005h
RXB0CON_RXM0_RTRRO_SIZE                  equ 0001h
RXB0CON_RXM0_RTRRO_LENGTH                equ 0001h
RXB0CON_RXM0_RTRRO_MASK                  equ 0020h
RXB0CON_RXM1_POSN                        equ 0006h
RXB0CON_RXM1_POSITION                    equ 0006h
RXB0CON_RXM1_SIZE                        equ 0001h
RXB0CON_RXM1_LENGTH                      equ 0001h
RXB0CON_RXM1_MASK                        equ 0040h
RXB0CON_RXFUL_POSN                       equ 0007h
RXB0CON_RXFUL_POSITION                   equ 0007h
RXB0CON_RXFUL_SIZE                       equ 0001h
RXB0CON_RXFUL_LENGTH                     equ 0001h
RXB0CON_RXFUL_MASK                       equ 0080h
RXB0CON_JTOFF_POSN                       equ 0001h
RXB0CON_JTOFF_POSITION                   equ 0001h
RXB0CON_JTOFF_SIZE                       equ 0001h
RXB0CON_JTOFF_LENGTH                     equ 0001h
RXB0CON_JTOFF_MASK                       equ 0002h
RXB0CON_RXB0DBEN_POSN                    equ 0002h
RXB0CON_RXB0DBEN_POSITION                equ 0002h
RXB0CON_RXB0DBEN_SIZE                    equ 0001h
RXB0CON_RXB0DBEN_LENGTH                  equ 0001h
RXB0CON_RXB0DBEN_MASK                    equ 0004h
RXB0CON_RXRTRRO_POSN                     equ 0003h
RXB0CON_RXRTRRO_POSITION                 equ 0003h
RXB0CON_RXRTRRO_SIZE                     equ 0001h
RXB0CON_RXRTRRO_LENGTH                   equ 0001h
RXB0CON_RXRTRRO_MASK                     equ 0008h
RXB0CON_RXM0_POSN                        equ 0005h
RXB0CON_RXM0_POSITION                    equ 0005h
RXB0CON_RXM0_SIZE                        equ 0001h
RXB0CON_RXM0_LENGTH                      equ 0001h
RXB0CON_RXM0_MASK                        equ 0020h
RXB0CON_FILHIT1_POSN                     equ 0001h
RXB0CON_FILHIT1_POSITION                 equ 0001h
RXB0CON_FILHIT1_SIZE                     equ 0001h
RXB0CON_FILHIT1_LENGTH                   equ 0001h
RXB0CON_FILHIT1_MASK                     equ 0002h
RXB0CON_FILHIT2_POSN                     equ 0002h
RXB0CON_FILHIT2_POSITION                 equ 0002h
RXB0CON_FILHIT2_SIZE                     equ 0001h
RXB0CON_FILHIT2_LENGTH                   equ 0001h
RXB0CON_FILHIT2_MASK                     equ 0004h
RXB0CON_FILHIT3_POSN                     equ 0003h
RXB0CON_FILHIT3_POSITION                 equ 0003h
RXB0CON_FILHIT3_SIZE                     equ 0001h
RXB0CON_FILHIT3_LENGTH                   equ 0001h
RXB0CON_FILHIT3_MASK                     equ 0008h
RXB0CON_RTRRO_POSN                       equ 0005h
RXB0CON_RTRRO_POSITION                   equ 0005h
RXB0CON_RTRRO_SIZE                       equ 0001h
RXB0CON_RTRRO_LENGTH                     equ 0001h
RXB0CON_RTRRO_MASK                       equ 0020h
RXB0CON_RXBODBEN_POSN                    equ 0002h
RXB0CON_RXBODBEN_POSITION                equ 0002h
RXB0CON_RXBODBEN_SIZE                    equ 0001h
RXB0CON_RXBODBEN_LENGTH                  equ 0001h
RXB0CON_RXBODBEN_MASK                    equ 0004h
RXB0CON_RXB0FILHIT0_POSN                 equ 0000h
RXB0CON_RXB0FILHIT0_POSITION             equ 0000h
RXB0CON_RXB0FILHIT0_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT0_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT0_MASK                 equ 0001h
RXB0CON_RXB0FILHIT1_POSN                 equ 0001h
RXB0CON_RXB0FILHIT1_POSITION             equ 0001h
RXB0CON_RXB0FILHIT1_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT1_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT1_MASK                 equ 0002h
RXB0CON_RXB0FILHIT2_POSN                 equ 0002h
RXB0CON_RXB0FILHIT2_POSITION             equ 0002h
RXB0CON_RXB0FILHIT2_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT2_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT2_MASK                 equ 0004h
RXB0CON_RXB0FILHIT3_POSN                 equ 0003h
RXB0CON_RXB0FILHIT3_POSITION             equ 0003h
RXB0CON_RXB0FILHIT3_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT3_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT3_MASK                 equ 0008h
RXB0CON_RXB0FILHIT4_POSN                 equ 0004h
RXB0CON_RXB0FILHIT4_POSITION             equ 0004h
RXB0CON_RXB0FILHIT4_SIZE                 equ 0001h
RXB0CON_RXB0FILHIT4_LENGTH               equ 0001h
RXB0CON_RXB0FILHIT4_MASK                 equ 0010h
RXB0CON_RXB0M0_POSN                      equ 0005h
RXB0CON_RXB0M0_POSITION                  equ 0005h
RXB0CON_RXB0M0_SIZE                      equ 0001h
RXB0CON_RXB0M0_LENGTH                    equ 0001h
RXB0CON_RXB0M0_MASK                      equ 0020h
RXB0CON_RXB0M1_POSN                      equ 0006h
RXB0CON_RXB0M1_POSITION                  equ 0006h
RXB0CON_RXB0M1_SIZE                      equ 0001h
RXB0CON_RXB0M1_LENGTH                    equ 0001h
RXB0CON_RXB0M1_MASK                      equ 0040h
RXB0CON_RXB0FUL_POSN                     equ 0007h
RXB0CON_RXB0FUL_POSITION                 equ 0007h
RXB0CON_RXB0FUL_SIZE                     equ 0001h
RXB0CON_RXB0FUL_LENGTH                   equ 0001h
RXB0CON_RXB0FUL_MASK                     equ 0080h
RXB0CON_RXB0RTRR0_POSN                   equ 0003h
RXB0CON_RXB0RTRR0_POSITION               equ 0003h
RXB0CON_RXB0RTRR0_SIZE                   equ 0001h
RXB0CON_RXB0RTRR0_LENGTH                 equ 0001h
RXB0CON_RXB0RTRR0_MASK                   equ 0008h
RXB0CON_RXB0RTRRO_POSN                   equ 0005h
RXB0CON_RXB0RTRRO_POSITION               equ 0005h
RXB0CON_RXB0RTRRO_SIZE                   equ 0001h
RXB0CON_RXB0RTRRO_LENGTH                 equ 0001h
RXB0CON_RXB0RTRRO_MASK                   equ 0020h

// Register: RXB0SIDH
#define RXB0SIDH RXB0SIDH
RXB0SIDH                                 equ 0F61h
// bitfield definitions
RXB0SIDH_SID3_POSN                       equ 0000h
RXB0SIDH_SID3_POSITION                   equ 0000h
RXB0SIDH_SID3_SIZE                       equ 0001h
RXB0SIDH_SID3_LENGTH                     equ 0001h
RXB0SIDH_SID3_MASK                       equ 0001h
RXB0SIDH_SID4_POSN                       equ 0001h
RXB0SIDH_SID4_POSITION                   equ 0001h
RXB0SIDH_SID4_SIZE                       equ 0001h
RXB0SIDH_SID4_LENGTH                     equ 0001h
RXB0SIDH_SID4_MASK                       equ 0002h
RXB0SIDH_SID5_POSN                       equ 0002h
RXB0SIDH_SID5_POSITION                   equ 0002h
RXB0SIDH_SID5_SIZE                       equ 0001h
RXB0SIDH_SID5_LENGTH                     equ 0001h
RXB0SIDH_SID5_MASK                       equ 0004h
RXB0SIDH_SID6_POSN                       equ 0003h
RXB0SIDH_SID6_POSITION                   equ 0003h
RXB0SIDH_SID6_SIZE                       equ 0001h
RXB0SIDH_SID6_LENGTH                     equ 0001h
RXB0SIDH_SID6_MASK                       equ 0008h
RXB0SIDH_SID7_POSN                       equ 0004h
RXB0SIDH_SID7_POSITION                   equ 0004h
RXB0SIDH_SID7_SIZE                       equ 0001h
RXB0SIDH_SID7_LENGTH                     equ 0001h
RXB0SIDH_SID7_MASK                       equ 0010h
RXB0SIDH_SID8_POSN                       equ 0005h
RXB0SIDH_SID8_POSITION                   equ 0005h
RXB0SIDH_SID8_SIZE                       equ 0001h
RXB0SIDH_SID8_LENGTH                     equ 0001h
RXB0SIDH_SID8_MASK                       equ 0020h
RXB0SIDH_SID9_POSN                       equ 0006h
RXB0SIDH_SID9_POSITION                   equ 0006h
RXB0SIDH_SID9_SIZE                       equ 0001h
RXB0SIDH_SID9_LENGTH                     equ 0001h
RXB0SIDH_SID9_MASK                       equ 0040h
RXB0SIDH_SID10_POSN                      equ 0007h
RXB0SIDH_SID10_POSITION                  equ 0007h
RXB0SIDH_SID10_SIZE                      equ 0001h
RXB0SIDH_SID10_LENGTH                    equ 0001h
RXB0SIDH_SID10_MASK                      equ 0080h
RXB0SIDH_RXB0SID3_POSN                   equ 0000h
RXB0SIDH_RXB0SID3_POSITION               equ 0000h
RXB0SIDH_RXB0SID3_SIZE                   equ 0001h
RXB0SIDH_RXB0SID3_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID3_MASK                   equ 0001h
RXB0SIDH_RXB0SID4_POSN                   equ 0001h
RXB0SIDH_RXB0SID4_POSITION               equ 0001h
RXB0SIDH_RXB0SID4_SIZE                   equ 0001h
RXB0SIDH_RXB0SID4_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID4_MASK                   equ 0002h
RXB0SIDH_RXB0SID5_POSN                   equ 0002h
RXB0SIDH_RXB0SID5_POSITION               equ 0002h
RXB0SIDH_RXB0SID5_SIZE                   equ 0001h
RXB0SIDH_RXB0SID5_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID5_MASK                   equ 0004h
RXB0SIDH_RXB0SID6_POSN                   equ 0003h
RXB0SIDH_RXB0SID6_POSITION               equ 0003h
RXB0SIDH_RXB0SID6_SIZE                   equ 0001h
RXB0SIDH_RXB0SID6_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID6_MASK                   equ 0008h
RXB0SIDH_RXB0SID7_POSN                   equ 0004h
RXB0SIDH_RXB0SID7_POSITION               equ 0004h
RXB0SIDH_RXB0SID7_SIZE                   equ 0001h
RXB0SIDH_RXB0SID7_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID7_MASK                   equ 0010h
RXB0SIDH_RXB0SID8_POSN                   equ 0005h
RXB0SIDH_RXB0SID8_POSITION               equ 0005h
RXB0SIDH_RXB0SID8_SIZE                   equ 0001h
RXB0SIDH_RXB0SID8_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID8_MASK                   equ 0020h
RXB0SIDH_RXB0SID9_POSN                   equ 0006h
RXB0SIDH_RXB0SID9_POSITION               equ 0006h
RXB0SIDH_RXB0SID9_SIZE                   equ 0001h
RXB0SIDH_RXB0SID9_LENGTH                 equ 0001h
RXB0SIDH_RXB0SID9_MASK                   equ 0040h
RXB0SIDH_RXB0SID10_POSN                  equ 0007h
RXB0SIDH_RXB0SID10_POSITION              equ 0007h
RXB0SIDH_RXB0SID10_SIZE                  equ 0001h
RXB0SIDH_RXB0SID10_LENGTH                equ 0001h
RXB0SIDH_RXB0SID10_MASK                  equ 0080h

// Register: RXB0SIDL
#define RXB0SIDL RXB0SIDL
RXB0SIDL                                 equ 0F62h
// bitfield definitions
RXB0SIDL_EID16_POSN                      equ 0000h
RXB0SIDL_EID16_POSITION                  equ 0000h
RXB0SIDL_EID16_SIZE                      equ 0001h
RXB0SIDL_EID16_LENGTH                    equ 0001h
RXB0SIDL_EID16_MASK                      equ 0001h
RXB0SIDL_EID17_POSN                      equ 0001h
RXB0SIDL_EID17_POSITION                  equ 0001h
RXB0SIDL_EID17_SIZE                      equ 0001h
RXB0SIDL_EID17_LENGTH                    equ 0001h
RXB0SIDL_EID17_MASK                      equ 0002h
RXB0SIDL_EXID_POSN                       equ 0003h
RXB0SIDL_EXID_POSITION                   equ 0003h
RXB0SIDL_EXID_SIZE                       equ 0001h
RXB0SIDL_EXID_LENGTH                     equ 0001h
RXB0SIDL_EXID_MASK                       equ 0008h
RXB0SIDL_SRR_POSN                        equ 0004h
RXB0SIDL_SRR_POSITION                    equ 0004h
RXB0SIDL_SRR_SIZE                        equ 0001h
RXB0SIDL_SRR_LENGTH                      equ 0001h
RXB0SIDL_SRR_MASK                        equ 0010h
RXB0SIDL_SID0_POSN                       equ 0005h
RXB0SIDL_SID0_POSITION                   equ 0005h
RXB0SIDL_SID0_SIZE                       equ 0001h
RXB0SIDL_SID0_LENGTH                     equ 0001h
RXB0SIDL_SID0_MASK                       equ 0020h
RXB0SIDL_SID1_POSN                       equ 0006h
RXB0SIDL_SID1_POSITION                   equ 0006h
RXB0SIDL_SID1_SIZE                       equ 0001h
RXB0SIDL_SID1_LENGTH                     equ 0001h
RXB0SIDL_SID1_MASK                       equ 0040h
RXB0SIDL_SID2_POSN                       equ 0007h
RXB0SIDL_SID2_POSITION                   equ 0007h
RXB0SIDL_SID2_SIZE                       equ 0001h
RXB0SIDL_SID2_LENGTH                     equ 0001h
RXB0SIDL_SID2_MASK                       equ 0080h
RXB0SIDL_RXB0EID16_POSN                  equ 0000h
RXB0SIDL_RXB0EID16_POSITION              equ 0000h
RXB0SIDL_RXB0EID16_SIZE                  equ 0001h
RXB0SIDL_RXB0EID16_LENGTH                equ 0001h
RXB0SIDL_RXB0EID16_MASK                  equ 0001h
RXB0SIDL_RXB0EID17_POSN                  equ 0001h
RXB0SIDL_RXB0EID17_POSITION              equ 0001h
RXB0SIDL_RXB0EID17_SIZE                  equ 0001h
RXB0SIDL_RXB0EID17_LENGTH                equ 0001h
RXB0SIDL_RXB0EID17_MASK                  equ 0002h
RXB0SIDL_RXB0EXID_POSN                   equ 0003h
RXB0SIDL_RXB0EXID_POSITION               equ 0003h
RXB0SIDL_RXB0EXID_SIZE                   equ 0001h
RXB0SIDL_RXB0EXID_LENGTH                 equ 0001h
RXB0SIDL_RXB0EXID_MASK                   equ 0008h
RXB0SIDL_RXB0SRR_POSN                    equ 0004h
RXB0SIDL_RXB0SRR_POSITION                equ 0004h
RXB0SIDL_RXB0SRR_SIZE                    equ 0001h
RXB0SIDL_RXB0SRR_LENGTH                  equ 0001h
RXB0SIDL_RXB0SRR_MASK                    equ 0010h
RXB0SIDL_RXB0SID0_POSN                   equ 0005h
RXB0SIDL_RXB0SID0_POSITION               equ 0005h
RXB0SIDL_RXB0SID0_SIZE                   equ 0001h
RXB0SIDL_RXB0SID0_LENGTH                 equ 0001h
RXB0SIDL_RXB0SID0_MASK                   equ 0020h
RXB0SIDL_RXB0SID1_POSN                   equ 0006h
RXB0SIDL_RXB0SID1_POSITION               equ 0006h
RXB0SIDL_RXB0SID1_SIZE                   equ 0001h
RXB0SIDL_RXB0SID1_LENGTH                 equ 0001h
RXB0SIDL_RXB0SID1_MASK                   equ 0040h
RXB0SIDL_RXB0SID2_POSN                   equ 0007h
RXB0SIDL_RXB0SID2_POSITION               equ 0007h
RXB0SIDL_RXB0SID2_SIZE                   equ 0001h
RXB0SIDL_RXB0SID2_LENGTH                 equ 0001h
RXB0SIDL_RXB0SID2_MASK                   equ 0080h

// Register: RXB0EIDH
#define RXB0EIDH RXB0EIDH
RXB0EIDH                                 equ 0F63h
// bitfield definitions
RXB0EIDH_EID8_POSN                       equ 0000h
RXB0EIDH_EID8_POSITION                   equ 0000h
RXB0EIDH_EID8_SIZE                       equ 0001h
RXB0EIDH_EID8_LENGTH                     equ 0001h
RXB0EIDH_EID8_MASK                       equ 0001h
RXB0EIDH_EID9_POSN                       equ 0001h
RXB0EIDH_EID9_POSITION                   equ 0001h
RXB0EIDH_EID9_SIZE                       equ 0001h
RXB0EIDH_EID9_LENGTH                     equ 0001h
RXB0EIDH_EID9_MASK                       equ 0002h
RXB0EIDH_EID10_POSN                      equ 0002h
RXB0EIDH_EID10_POSITION                  equ 0002h
RXB0EIDH_EID10_SIZE                      equ 0001h
RXB0EIDH_EID10_LENGTH                    equ 0001h
RXB0EIDH_EID10_MASK                      equ 0004h
RXB0EIDH_EID11_POSN                      equ 0003h
RXB0EIDH_EID11_POSITION                  equ 0003h
RXB0EIDH_EID11_SIZE                      equ 0001h
RXB0EIDH_EID11_LENGTH                    equ 0001h
RXB0EIDH_EID11_MASK                      equ 0008h
RXB0EIDH_EID12_POSN                      equ 0004h
RXB0EIDH_EID12_POSITION                  equ 0004h
RXB0EIDH_EID12_SIZE                      equ 0001h
RXB0EIDH_EID12_LENGTH                    equ 0001h
RXB0EIDH_EID12_MASK                      equ 0010h
RXB0EIDH_EID13_POSN                      equ 0005h
RXB0EIDH_EID13_POSITION                  equ 0005h
RXB0EIDH_EID13_SIZE                      equ 0001h
RXB0EIDH_EID13_LENGTH                    equ 0001h
RXB0EIDH_EID13_MASK                      equ 0020h
RXB0EIDH_EID14_POSN                      equ 0006h
RXB0EIDH_EID14_POSITION                  equ 0006h
RXB0EIDH_EID14_SIZE                      equ 0001h
RXB0EIDH_EID14_LENGTH                    equ 0001h
RXB0EIDH_EID14_MASK                      equ 0040h
RXB0EIDH_EID15_POSN                      equ 0007h
RXB0EIDH_EID15_POSITION                  equ 0007h
RXB0EIDH_EID15_SIZE                      equ 0001h
RXB0EIDH_EID15_LENGTH                    equ 0001h
RXB0EIDH_EID15_MASK                      equ 0080h
RXB0EIDH_RXB0EID8_POSN                   equ 0000h
RXB0EIDH_RXB0EID8_POSITION               equ 0000h
RXB0EIDH_RXB0EID8_SIZE                   equ 0001h
RXB0EIDH_RXB0EID8_LENGTH                 equ 0001h
RXB0EIDH_RXB0EID8_MASK                   equ 0001h
RXB0EIDH_RXB0EID9_POSN                   equ 0001h
RXB0EIDH_RXB0EID9_POSITION               equ 0001h
RXB0EIDH_RXB0EID9_SIZE                   equ 0001h
RXB0EIDH_RXB0EID9_LENGTH                 equ 0001h
RXB0EIDH_RXB0EID9_MASK                   equ 0002h
RXB0EIDH_RXB0EID10_POSN                  equ 0002h
RXB0EIDH_RXB0EID10_POSITION              equ 0002h
RXB0EIDH_RXB0EID10_SIZE                  equ 0001h
RXB0EIDH_RXB0EID10_LENGTH                equ 0001h
RXB0EIDH_RXB0EID10_MASK                  equ 0004h
RXB0EIDH_RXB0EID11_POSN                  equ 0003h
RXB0EIDH_RXB0EID11_POSITION              equ 0003h
RXB0EIDH_RXB0EID11_SIZE                  equ 0001h
RXB0EIDH_RXB0EID11_LENGTH                equ 0001h
RXB0EIDH_RXB0EID11_MASK                  equ 0008h
RXB0EIDH_RXB0EID12_POSN                  equ 0004h
RXB0EIDH_RXB0EID12_POSITION              equ 0004h
RXB0EIDH_RXB0EID12_SIZE                  equ 0001h
RXB0EIDH_RXB0EID12_LENGTH                equ 0001h
RXB0EIDH_RXB0EID12_MASK                  equ 0010h
RXB0EIDH_RXB0EID13_POSN                  equ 0005h
RXB0EIDH_RXB0EID13_POSITION              equ 0005h
RXB0EIDH_RXB0EID13_SIZE                  equ 0001h
RXB0EIDH_RXB0EID13_LENGTH                equ 0001h
RXB0EIDH_RXB0EID13_MASK                  equ 0020h
RXB0EIDH_RXB0EID14_POSN                  equ 0006h
RXB0EIDH_RXB0EID14_POSITION              equ 0006h
RXB0EIDH_RXB0EID14_SIZE                  equ 0001h
RXB0EIDH_RXB0EID14_LENGTH                equ 0001h
RXB0EIDH_RXB0EID14_MASK                  equ 0040h
RXB0EIDH_RXB0EID15_POSN                  equ 0007h
RXB0EIDH_RXB0EID15_POSITION              equ 0007h
RXB0EIDH_RXB0EID15_SIZE                  equ 0001h
RXB0EIDH_RXB0EID15_LENGTH                equ 0001h
RXB0EIDH_RXB0EID15_MASK                  equ 0080h

